NordicPlayground/nrf528xx-ble-throughput-demo/ble_app_att_mtu_throughput/main.c
/* Copyright (c) 2016 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/**@cond To Make Doxygen skip documentation generation for this file.
 * @{
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>

#include "amt.h"
#include "counter.h"

#include "sdk_config.h"
#include "boards.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "nrf.h"
#include "ble.h"
#include "ble_hci.h"
#include "nordic_common.h"
#include "nrf_gpio.h"
#include "ble_advdata.h"
#include "ble_srv_common.h"
#include "softdevice_handler.h"
#include "nrf_ble_gatt.h"
#include "app_timer.h"
#include "app_error.h"
#include "ble_conn_params.h"

#include "display.h"

#define NRF_LOG_MODULE_NAME "DEMO"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"


#define TIMER_PRESCALER         0                                   /**< Value of the RTC1 PRESCALER register. */
#define TIMER_OP_QUEUE_SIZE     4                                   /**< Size of timer operation queues. */

#define ATT_MTU_DEFAULT         158                                 /**< Default ATT MTU size, in bytes. */
#define CONN_INTERVAL_DEFAULT   MSEC_TO_UNITS(15, UNIT_1_25_MS)     /**< Default connection interval used at connection establishment by central side. */

#define CONN_INTERVAL_MIN       MSEC_TO_UNITS(7.5, UNIT_1_25_MS)    /**< Minimum acceptable connection interval, in 1.25 ms units. */
#define CONN_INTERVAL_MAX       MSEC_TO_UNITS(500, UNIT_1_25_MS)    /**< Maximum acceptable connection interval, in 1.25 ms units. */
#define CONN_SUP_TIMEOUT        MSEC_TO_UNITS(4000,  UNIT_10_MS)    /**< Connection supervisory timeout (4 seconds). */
#define SLAVE_LATENCY           0                                   /**< Slave latency. */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(500, TIMER_PRESCALER)      /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (0.5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(500, TIMER_PRESCALER)      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (0.5 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    2                                          /**< Number of attempts before giving up the connection parameter negotiation. */

#define LED_SCANNING_ADVERTISING  BSP_BOARD_LED_0
#define LED_READY                 BSP_BOARD_LED_1
#define LED_PROGRESS              BSP_BOARD_LED_2
#define LED_FINISHED              BSP_BOARD_LED_3

#define YES     'y'
#define ONE     '1'
#define TWO     '2'
#define THREE   '3'
#define FOUR    '4'
#define ENTER   '\r'

#ifdef NRF52840_XXAA
#define BUTTON_SEL				  BUTTON_2
#define BUTTON_ENTER			  BUTTON_1
#define BUTTON_BACK				  BUTTON_3
#endif

#ifdef NRF52832
#define BUTTON_SEL				  5
#define BUTTON_ENTER			  7
#define BUTTON_BACK				  11
#endif

#define BUTTON_DETECTION_DELAY    APP_TIMER_TICKS(50, TIMER_PRESCALER)       /**< Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks). */

#define LL_HEADER_LEN             4
#define BYTE                      8
#define KBYTE                     1024


typedef enum
{
    NOT_SELECTED = 0x00,
    BOARD_TESTER,
    BOARD_DUMMY,
} board_role_t;


/**@brief Variable length data encapsulation in terms of length and pointer to data. */
typedef struct
{
    uint8_t  * p_data;      /**< Pointer to data. */
    uint16_t   data_len;    /**< Length of data. */
} data_t;


static volatile bool             m_run_test;
static volatile bool             m_notif_enabled;
static volatile bool             m_mtu_exchanged;
static volatile bool             m_print_menu;
static volatile bool             m_conn_interval_configured;
static volatile board_role_t     m_board_role    = NOT_SELECTED;
static uint16_t                  m_conn_handle   = BLE_CONN_HANDLE_INVALID; /**< Handle of the current BLE connection .*/
static uint8_t                   m_gap_role      = BLE_GAP_ROLE_INVALID;    /**< BLE role for this connection, see @ref BLE_GAP_ROLES */

static nrf_ble_gatt_t            m_gatt;                /**< GATT module instance. */
static ble_db_discovery_t        m_ble_db_discovery;    /**< Structure used to identify the DB Discovery module. */

static nrf_ble_amtc_t            m_amtc;
static nrf_ble_amts_t            m_amts;

typedef enum
{
	INIT,
	RECEIVER,
	SENDER,
	CONFIG,
	CONFIG_MTU,
	CONFIG_CONN_INT,
	CONFIG_DLE,
	TEST_BEGIN,
	TEST_RUN,
}
state_t;

static state_t state = INIT;
static uint8_t pointer_position = 0;
static volatile uint8_t button_pushed = 0xff;

static volatile bool 			m_display_show = false;
static volatile bool 			m_display_show_transfer_data = false;
static volatile bool			m_transfer_done = false;
static transfer_data_t			m_transfer_data = {.kb_transfer_size = (AMT_BYTE_TRANSFER_CNT/1024), .kB_transfered = 0};

/* Name to use for advertising and connection. */
static const char m_target_periph_name[] = DEVICE_NAME;

/* Test parameters. */
static test_params_t m_test_params =
{
    .att_mtu                  = ATT_MTU_DEFAULT,
    .conn_interval            = CONN_INTERVAL_DEFAULT,
    .data_len_ext_enabled     = true,
    .conn_evt_len_ext_enabled = true,
};

/* Scan parameters requested for scanning and connection. */
static ble_gap_scan_params_t const m_scan_param =
{
    .active         = 0x00,
    .interval       = SCAN_INTERVAL,
    .window         = SCAN_WINDOW,
    .use_whitelist  = 0x00,
    .adv_dir_report = 0x00,
    .timeout        = 0x0000, // No timeout.
};

/* Connection parameters requested for connection. */
static ble_gap_conn_params_t m_conn_param =
{
    .min_conn_interval = (uint16_t)CONN_INTERVAL_MIN,   // Minimum connection interval.
    .max_conn_interval = (uint16_t)CONN_INTERVAL_MAX,   // Maximum connection interval.
    .slave_latency     = (uint16_t)SLAVE_LATENCY,       // Slave latency.
    .conn_sup_timeout  = (uint16_t)CONN_SUP_TIMEOUT     // Supervisory timeout.
};


