NordicPlayground/nrf528xx-ble-throughput-demo/ble_app_att_mtu_throughput/main.c
void advertising_start(void);
void scan_start(void);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_leds_init();
    bsp_board_leds_off();
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timer_init(void)
{
    // Initialize timer module.
    APP_TIMER_INIT(TIMER_PRESCALER, TIMER_OP_QUEUE_SIZE, false);
}


/**@brief Function for initializing GAP parameters.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_ppcp_set(&m_conn_param);
    APP_ERROR_CHECK(err_code);

}


void test_run(void)
{
    NRF_LOG_RAW_INFO("\r\n");
    NRF_LOG_INFO("Test is ready. Press any key to run.\r\n");
    NRF_LOG_FLUSH();

    (void) NRF_LOG_GETCHAR();

    counter_start();
    nrf_ble_amts_notif_spam(&m_amts);
}


void menu_print(void);

void terminate_test(void)
{
    m_run_test                 = false;
    m_notif_enabled            = false;
    m_mtu_exchanged            = false;
    m_conn_interval_configured = false;
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        NRF_LOG_INFO("Disconnecting.\r\n");
		display_print_line_inc("Disconnecting", 0);
		m_display_show = true;
		
        ret_code_t ret = sd_ble_gap_disconnect(m_conn_handle,
            BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (ret != NRF_SUCCESS)
        {
            NRF_LOG_ERROR("Disconnected returned 0x%0x", ret);
        }
    }
    else
    {
        if (m_board_role == BOARD_TESTER)
        {
            m_print_menu = true;
        }
        if (m_board_role == BOARD_DUMMY)
        {
            if (m_gap_role == BLE_GAP_ROLE_PERIPH)
            {
                advertising_start();
            }
            else
            {
                scan_start();
            }
        }
    }
}


/**@brief AMT Service Handler.
 */
static void amts_evt_handler(nrf_ble_amts_evt_t evt)
{
    ret_code_t  err_code;
    switch (evt.evt_type)
    {
        case SERVICE_EVT_NOTIF_ENABLED:
        {
            bsp_board_led_on(LED_READY);
            NRF_LOG_INFO("Notifications enabled.\r\n");
			display_print_line_inc("Notifications enabled.", 0);
			m_display_show = true;
			
            m_notif_enabled = true;
            if (m_board_role == BOARD_TESTER)
            {
                if (m_gap_role == BLE_GAP_ROLE_PERIPH)
                {
                    m_conn_interval_configured = false;
                    m_conn_param.min_conn_interval = m_test_params.conn_interval;
                    m_conn_param.max_conn_interval = m_test_params.conn_interval+1;
                    err_code = ble_conn_params_change_conn_params(&m_conn_param);
                    if (err_code != NRF_SUCCESS)
                    {
                        NRF_LOG_ERROR("sd_ble_gap_conn_param_update returned 0x%x.\r\n", err_code);
                    }
                }
                if (m_gap_role == BLE_GAP_ROLE_CENTRAL)
                {
                    m_conn_interval_configured     = true;
                    m_conn_param.min_conn_interval = m_test_params.conn_interval;
                    m_conn_param.max_conn_interval = m_test_params.conn_interval;
                    err_code = sd_ble_gap_conn_param_update(m_conn_handle,
                                                                       &m_conn_param);
                    if (err_code != NRF_SUCCESS)
                    {
                        NRF_LOG_ERROR("sd_ble_gap_conn_param_update returned 0x%x.\r\n", err_code);
                    }
                }
            }
        } break;

        case SERVICE_EVT_NOTIF_DISABLED:
            bsp_board_led_off(LED_READY);
            NRF_LOG_INFO("Notifications disabled.\r\n");
            break;

        case SERVICE_EVT_TRANSFER_1KB:
        {
			m_transfer_data.kB_transfered++;
			m_display_show_transfer_data = true;
			
            bsp_board_led_invert(LED_PROGRESS);
        } break;

        case SERVICE_EVT_TRANSFER_FINISHED:
        {
			counter_stop();
			display_clear();
			
            bsp_board_led_off(LED_PROGRESS);
            bsp_board_led_on(LED_FINISHED);

			display_draw_nordic_logo();
			display_print_line_inc("Transfer done.", 0);
			
			char str[50];
			
			uint32_t counter_ticks = counter_get();
			sprintf(str, "Time: %d.%d seconds elapsed.", (counter_ticks / 100), (counter_ticks % 100));
			display_print_line_inc(str, 0);
			
            NRF_LOG_INFO("Transfered 1MB bytes (sent %u bytes).\r\n", evt.bytes_transfered_cnt);
			sprintf(str, "Transfered 1MB (sent %u bytes).", evt.bytes_transfered_cnt);
			display_print_line_inc(str, 0);
			
            float timems = (float)(counter_get());
            uint32_t sent_octet_cnt = evt.bytes_transfered_cnt * BYTE;
            float throughput = (float)(sent_octet_cnt * 100) / timems;
            throughput = throughput / (float)KBYTE;
            NRF_LOG_RAW_INFO("\r\n");
            counter_print();
			
