NordicPlayground/nrf528xx-ble-throughput-demo/ble_app_att_mtu_throughput/main.c
    NRF_LOG_RAW_INFO("\r\n");
    NRF_LOG_INFO("Current test configuration:\r\n");
    NRF_LOG_INFO("===============================\r\n");
    NRF_LOG_INFO("ATT MTU size: %d\r\n", m_test_params.att_mtu);
    NRF_LOG_INFO("Conn. interval: 0x%x\r\n", m_test_params.conn_interval);
    NRF_LOG_INFO("Data length extension (DLE): %s\r\n", m_test_params.data_len_ext_enabled ?
                 (uint32_t)"ON" :
                 (uint32_t)"OFF");
    NRF_LOG_INFO("Conn. event length ext.: %s\r\n", m_test_params.conn_evt_len_ext_enabled ?
                 (uint32_t)"ON" :
                 (uint32_t)"OFF");
    NRF_LOG_INFO("===============================\r\n");
    NRF_LOG_RAW_INFO("\r\n");
    NRF_LOG_FLUSH();
}


void test_begin(void)
{
    NRF_LOG_INFO("Preparing the test.\r\n");
	
	display_print_line_inc("Preparing the test.", 0);
	display_show();
	
    NRF_LOG_FLUSH();

    switch (m_gap_role)
    {
        default:
            // If no connection was established, the role won't be either.
            // In this case, start both advertising and scanning.
            advertising_start();
            scan_start();
            break;

        case BLE_GAP_ROLE_PERIPH:
            advertising_start();
            break;

        case BLE_GAP_ROLE_CENTRAL:
            scan_start();
            break;
    }
}


void menu_print(void)
{
    bool begin_test = false;

    while (!begin_test)
    {
        test_params_print();
        NRF_LOG_INFO("Select an option:\r\n");
        NRF_LOG_INFO(" 1) Run test.\r\n");
        NRF_LOG_INFO(" 2) Adjust test parameters.\r\n");
        NRF_LOG_FLUSH();

        switch (NRF_LOG_GETCHAR())
        {
            case ONE:
            default:
                begin_test = true;
                test_begin();
                break;

            case TWO:
                test_param_adjust();
                break;
        }
    }

    m_print_menu = false;
}


static bool is_test_ready()
{
    if((m_conn_interval_configured)&&
       !m_run_test &&
       m_notif_enabled &&
       m_mtu_exchanged)
    {
        return true;
    }
    return false;
}

static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
	button_pushed = pin_no;
}

void buttons_init()
{
	uint32_t err_code;

   // The array must be static because a pointer to it will be saved in the button library.
    static app_button_cfg_t buttons[] =
    {
        {BUTTON_SEL, false, BUTTON_PULL, button_event_handler},
		{BUTTON_ENTER, false, BUTTON_PULL, button_event_handler},
        {BUTTON_BACK, false, BUTTON_PULL, button_event_handler}
    };
	
    err_code = app_button_init(buttons, ARRAY_SIZE(buttons), BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
	
    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
}

void state_init_action(uint8_t button)
{
	if(button_pushed != 0xff)
	{
		switch(button_pushed)
		{
			case BUTTON_SEL:
				pointer_position ^= 1;
				display_draw_init_screen(pointer_position);
				break;
			case BUTTON_ENTER:
				if(pointer_position == 0)
				{
					pointer_position = 0;
					m_board_role = BOARD_TESTER;
					display_draw_sender_screen(pointer_position, &m_test_params);
					state = SENDER;
				}
				else
				{
					display_clear();
					m_board_role = BOARD_DUMMY;
					advertising_start();
					scan_start();
					//display_draw_receiver_screen();
					state = RECEIVER;
				}
				
				break;
			case BUTTON_BACK:
				//no action required
				break;
			default:
				break;
		}
		
		button_pushed = 0xff;
	}
}

void state_receive_action(uint8_t button)
{
	if(button_pushed == BUTTON_BACK)
	{
		pointer_position = 1;
		display_draw_init_screen(pointer_position);
		state = INIT;
		
		uint32_t err_code;
		if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
		{
			err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			APP_ERROR_CHECK(err_code);
		}
		else
		{
			err_code = sd_ble_gap_adv_stop();
			APP_ERROR_CHECK(err_code);
			err_code = sd_ble_gap_scan_stop();
			APP_ERROR_CHECK(err_code);
		}
		button_pushed = 0xff;
	}
}

void state_sender_action(uint8_t button)
{
	if(button_pushed != 0xff)
	{
		switch(button_pushed)
		{
			case BUTTON_SEL:
				pointer_position ^= 1;
				display_draw_sender_screen(pointer_position, &m_test_params);
				break;
			case BUTTON_ENTER:
				if(pointer_position == 0)
				{
					state = TEST_BEGIN;
					display_draw_test_start_screen();
					test_begin();
				}
				else
				{
					state = CONFIG;
					pointer_position = 0;
					display_draw_config_screen(pointer_position, &m_test_params);
				}
				break;
			case BUTTON_BACK:
				pointer_position = 0;
				display_draw_init_screen(pointer_position);
				state = INIT;
				break;
			default:
				break;
		}
		
		button_pushed = 0xff;
	}
}

void state_test_begin_action()
{
	if(is_test_ready())
	{
		display_print_line_inc("Test is ready. Press any button to run", 0);
		display_show();
		
		//TODO: make this interrupt based instead
		//wait for user to push button
		button_pushed = 0xff;
		while(button_pushed == 0xff)
		{
			wait_for_event();
		}
		
		display_draw_test_run_screen(&m_transfer_data);
		
		counter_start();
		nrf_ble_amts_notif_spam(&m_amts);
		
		state = TEST_RUN;
	}
}

void state_test_run_action()
{
	if(m_display_show_transfer_data)
	{
		display_draw_test_run_screen(&m_transfer_data);
		m_display_show_transfer_data = false;
	}
	if(m_transfer_done)
	{
		if(button_pushed != 0xff)
		{
			m_transfer_data.kB_transfered = 0;
			
			pointer_position = 0;
			state = INIT;
			display_draw_init_screen(pointer_position);
			
			m_transfer_done = false;
			button_pushed = 0xff;
		}
	}
}

void state_config_action(uint8_t button)
{
	if(button_pushed != 0xff)
	{
		switch(button_pushed)
		{
			case BUTTON_SEL:
				pointer_position++;
				if(pointer_position > 2)
				{
					pointer_position = 0;
				}
				display_draw_config_screen(pointer_position, &m_test_params);
				break;
			case BUTTON_ENTER:
				if(pointer_position == 0)
				{
					state = CONFIG_MTU;
					pointer_position = 0;
					display_draw_config_mtu_screen(pointer_position, &m_test_params);
				}
				else if(pointer_position == 1)
				{
					state = CONFIG_CONN_INT;
					pointer_position = 0;
					display_draw_config_conn_int_screen(pointer_position, &m_test_params);
				}
				else
				{
					state = CONFIG_DLE;
					pointer_position = 0;
					display_draw_config_dle_screen(pointer_position, &m_test_params);
				}
				break;
			case BUTTON_BACK:
				pointer_position = 0;
				display_draw_sender_screen(pointer_position, &m_test_params);
				state = SENDER;
				break;
			default:
				break;
		}
		
		button_pushed = 0xff;
	}
}

void state_config_mtu_action(uint8_t button)
{
	if(button_pushed != 0xff)
	{
		switch(button_pushed)
		{
			case BUTTON_SEL:
				pointer_position++;
				if(pointer_position > 2)
				{
					pointer_position = 0;
				}
				display_draw_config_mtu_screen(pointer_position, &m_test_params);
				break;
			case BUTTON_ENTER:
				if(pointer_position == 0)
				{
					m_test_params.att_mtu = 23;
				}
				else if(pointer_position == 1)
				{
					m_test_params.att_mtu = 158;
				}
				else
				{
					m_test_params.att_mtu = 247;
				}
				gatt_mtu_set(m_test_params.att_mtu);
				
			case BUTTON_BACK:
				pointer_position = 0;
				display_draw_config_screen(pointer_position, &m_test_params);
				state = CONFIG;
				break;
			default:
				break;
		}
		
		button_pushed = 0xff;
	}
}

void state_config_conn_int_action(uint8_t button)
{
	if(button_pushed != 0xff)
	{
		switch(button_pushed)
		{
			case BUTTON_SEL:
				pointer_position++;
				if(pointer_position > 2)
				{
					pointer_position = 0;
				}
				display_draw_config_conn_int_screen(pointer_position, &m_test_params);
				break;
			case BUTTON_ENTER:
				if(pointer_position == 0)
				{
					m_test_params.conn_interval = (uint16_t)(MSEC_TO_UNITS(7.5, UNIT_1_25_MS));
				}
				else if(pointer_position == 1)
				{
					m_test_params.conn_interval = (uint16_t)(MSEC_TO_UNITS(50, UNIT_1_25_MS));
				}
				else
				{
					m_test_params.conn_interval = (uint16_t)(MSEC_TO_UNITS(400, UNIT_1_25_MS));
				}
				
			case BUTTON_BACK:
				pointer_position = 0;
				display_draw_config_screen(pointer_position, &m_test_params);
				state = CONFIG;
				break;
			default:
				break;
		}
		
		button_pushed = 0xff;
	}
}

void state_config_dle_action(uint8_t button)
{
	if(button_pushed != 0xff)
	{
		switch(button_pushed)
		{
			case BUTTON_SEL:
				pointer_position++;
				if(pointer_position > 1)
				{
					pointer_position = 0;
				}
				display_draw_config_dle_screen(pointer_position, &m_test_params);
				break;
			case BUTTON_ENTER:
				if(pointer_position == 0)
				{
					m_test_params.data_len_ext_enabled = 1;
				}
				else
				{
					m_test_params.data_len_ext_enabled = 0;
				}
				
				data_len_ext_set(m_test_params.data_len_ext_enabled);
			case BUTTON_BACK:
				pointer_position = 0;
				display_draw_config_screen(pointer_position, &m_test_params);
				state = CONFIG;
				break;
			default:
				break;
		}
		
		button_pushed = 0xff;
	}
}

int main(void)
{
	display_init();
	
    log_init();

    leds_init();
    timer_init();
    counter_init();
    buttons_init();

    ble_stack_init();

    gap_params_init();
    conn_params_init();
    gatt_init();
    advertising_data_set();

    server_init();
    client_init();

    // Default ATT MTU size and connection interval are set at compile time.
    // Data Length Extension (DLE) is on by default.
    // Enable the Connection Event Length Extension.
    conn_evt_len_ext_set(m_test_params.conn_evt_len_ext_enabled);

	display_draw_init_screen(pointer_position);

    for (;;)
    {
		switch(state)
		{
			case INIT:
				state_init_action(button_pushed);
				break;
			case RECEIVER:
				state_receive_action(button_pushed);
				break;
			case SENDER:
				state_sender_action(button_pushed);
				break;
			case CONFIG:
				state_config_action(button_pushed);
				break;
			case CONFIG_MTU:
				state_config_mtu_action(button_pushed);
				break;
			case CONFIG_CONN_INT:
				state_config_conn_int_action(button_pushed);
				break;
			case CONFIG_DLE:
				state_config_dle_action(button_pushed);
				break;
			case TEST_BEGIN:
				state_test_begin_action();
				break;
			case TEST_RUN:
				state_test_run_action();
				break;
			default:
				break;
		}
		
		if(m_display_show)
		{
			display_show();
			m_display_show = false;
		}
		
		if (!NRF_LOG_PROCESS())
        {
            wait_for_event();
        }
    }
}


/**
 * @}
 */
